---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSetIterator
source: html/cb466fd1-ac20-abc9-74b0-b022fd6d3b02.htm
---
# TemperatureRatingTypeSetIterator Methods

Causes the object to release immediately any resources it may be utilizing.